Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/sketch.ino
/* ------------- governor limits, mirroring evidence.py ------------- */
const uint8_t  MAX_GROUP         = 3;
const uint32_t MAX_ACTIVATION_MS = 6000;
const uint32_t MIN_SILENCE_MS    = 20000;
const uint32_t DAILY_BUDGET_MS   = 120000;
const uint32_t ESCALATE_AFTER_MS = 25000;
const uint8_t  MAX_ATTEMPTS      = 3;
/* Live demos cannot wait 20 s between bursts, so the long timers are divided
 * by this and the true values are printed at boot - the compression is stated,
 * not hidden. Set to 4, not 10: at 10x, escalation fires 2.5 s after detection,
 * which is quicker than you can reach for a button, so every veto you try to
 * demonstrate has already gone to amber. Verified in the simulator. */
const uint16_t DEMO_SPEED        = 4;

const float DESK_SCALE  = 2.8;    // cm on the bench per metre of field range
const float RANGE_MAX_M = 42.8;
const float LINE_M      = 12.0;

enum State { IDLE, TRACKING, EMITTING, COOLDOWN, ESCALATED, INHIBITED };
State state = IDLE;

uint32_t emitStartedAt = 0, lastEmissionEnd = 0, exposureUsedMs = 0;
uint32_t incidentStart = 0, lastBeat = 0, lastPrint = 0;
uint8_t  attempts = 0;
bool     doNotEmit = false, estopLatched = false, armedLed = false;

uint32_t scaled(uint32_t ms) { return ms / DEMO_SPEED; }

/* ---- LEDC portability shim: core 2.x and 3.x ----
 * ESP_ARDUINO_VERSION_MAJOR is undefined on very old cores, which the
 * preprocessor treats as 0, so the 2.x branch is the safe default. */
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
static inline void emitAttach()            { ledcAttach(PIN_EMIT, CARRIER_HZ, LEDC_RES); }
static inline void emitDuty(uint32_t duty) { ledcWrite(PIN_EMIT, duty); }
#else
static inline void emitAttach() {
  ledcSetup(LEDC_CH, CARRIER_HZ, LEDC_RES);
  ledcAttachPin(PIN_EMIT, LEDC_CH);
}
static inline void emitDuty(uint32_t duty) { ledcWrite(LEDC_CH, duty); }
#endif

void emitStop();
float pingOnceCm();
void selfCheck();
void consoleHelp();
void consoleTick();
void consoleRun(char *, uint8_t);

/* ---------------- input conditioning ----------------
 *
 * Three noise sources, three specific demo failures:
 *
 *   button bounce   -> one glitch on a jumper latches the E-stop and the
 *                      emitter is dead for the rest of the presentation
 *   ADC noise       -> ESP32 ADC1 wanders by tens of counts while nothing
 *                      moves; the group-size threshold is an integer boundary,
 *                      so a still potentiometer flips PERMITTED / REFUSED
 *   sonar outliers  -> a real HC-SR04 throws a bad ping regularly, off soft
 *                      surfaces or while the previous burst is still ringing;
 *                      one of those reads as 'target lost' and resets the run
 *
 * None of this changes a single governor rule. It only stops the inputs from
 * lying to the rules.
 */

// A pin must agree with itself on this many consecutive passes to be believed.
const uint8_t DEBOUNCE_PASSES = 4;
const uint8_t GROUP_PASSES    = 3;
const uint8_t ADC_SAMPLES     = 16;
const uint8_t PING_GAP_MS     = 10;   // let the previous burst die down
const uint8_t CONSOLE_IDLE_MS = 80;   // dispatch a command with no terminator

const uint8_t B_PERSON = 0, B_NONTARGET = 1, B_ESTOP = 2, B_COUNT = 3;
int     btnPin[B_COUNT];
bool    btnStable[B_COUNT]    = {false, false, false};
bool    btnCandidate[B_COUNT] = {false, false, false};
uint8_t btnAgree[B_COUNT]     = {0, 0, 0};

bool pressed(uint8_t i) {
  bool raw = (digitalRead(btnPin[i]) == LOW);      // press-to-ground
  if (raw != btnCandidate[i]) { btnCandidate[i] = raw; btnAgree[i] = 0; }
  else if (btnAgree[i] < DEBOUNCE_PASSES) { btnAgree[i]++; }
  if (btnAgree[i] >= DEBOUNCE_PASSES) btnStable[i] = btnCandidate[i];
  return btnStable[i];
}

uint8_t groupStable = 1;
uint8_t groupTyped  = 1;        // used when no pot is fitted

uint8_t readGroup() {
#if !HAVE_POT
  return groupTyped;
#else
  uint32_t acc = 0;
  for (uint8_t i = 0; i < ADC_SAMPLES; i++) acc += analogRead(POT_GROUP);
  long    span = map((long)(acc / ADC_SAMPLES), 0L, 4095L, 1L, 8L);
  uint8_t want = (uint8_t)constrain(span, 1L, 8L);

  static uint8_t candidate = 1, agree = 0;
  if (want != candidate) { candidate = want; agree = 0; }
  else if (agree < GROUP_PASSES) { agree++; }
  if (agree >= GROUP_PASSES) groupStable = candidate;
  return groupStable;
#endif
}

/* ---------------- serial console ----------------
 *
 * Every physical input has a keyboard equivalent, for two reasons. A rig gets
 * built with parts that did not arrive, and a rig gets demonstrated in a room
 * where a jumper has shaken loose. Neither should cost you the argument, and
 * the argument is the refusals.
 *
 * Typing a veto is not the same claim as pressing one, so the console says
 * which it was in the log. Do not narrate a typed veto as a wired one.
 */
bool  typedPerson = false, typedNonTarget = false;
float simDistanceCm = 999.0f;   // used when no sensor is fitted

void consoleHelp() {
  Serial.println("console: g1..g8 group size | p person veto | n dog/goat veto");
  Serial.println("         e e-stop | r clear latches | ? this help");
#if !HAVE_SENSOR
  Serial.println("         d0..d400 distance in cm, e.g. d80 -> permitted");
#endif
#if !HAVE_POT
  Serial.println("         no pot fitted, so group size comes from g1..g8");
#endif
}

void consoleRun(char *line, uint8_t len) {
  char cmd = line[0];
  long arg = (len > 1) ? atol(line + 1) : -1;

  if (cmd == 'g') {
    if (arg >= 1 && arg <= 8) {
      groupTyped = (uint8_t)arg;
      Serial.printf("console: group size set to %u\n", groupTyped);
    } else {
      Serial.println("console: group size must be 1 to 8, e.g. g5");
    }
  } else if (cmd == 'd') {
    if (arg >= 0 && arg <= 400) {
      simDistanceCm = (float)arg;
      Serial.printf("console: distance set to %ld cm (%.1f m scaled)\n",
                    arg, arg / DESK_SCALE);
    } else {
      Serial.println("console: distance must be 0 to 400 cm, e.g. d80");
    }
  } else if (cmd == 'p') {
    typedPerson = !typedPerson;
    Serial.printf("console: PERSON veto %s (typed, not wired)\n",
                  typedPerson ? "on" : "off");
  } else if (cmd == 'n') {
    typedNonTarget = !typedNonTarget;
    Serial.printf("console: DOG/GOAT veto %s (typed, not wired)\n",
                  typedNonTarget ? "on" : "off");
  } else if (cmd == 'e') {
    estopLatched = true;
    Serial.println("console: E-STOP asserted");
  } else if (cmd == 'r') {
    /* Clear the typed vetoes too.
     *
     * They are toggles, so anything driving this console - a person or the web
     * page - has no way to read their state, only to flip them. A reset that
     * leaves them set means the driver's model and the board disagree from the
     * first command onward, and every later toggle stays inverted. Reset has
     * to mean reset, or it is just another source of drift. */
    estopLatched = false;
    doNotEmit = false;
    typedPerson = false;
    typedNonTarget = false;
    exposureUsedMs = 0;
    state = IDLE;
    attempts = 0;
    incidentStart = 0;
    Serial.println("console: latches cleared");
  } else if (cmd == '?') {
    consoleHelp();
  } else {
    Serial.printf("console: unknown command '%s', try ?\n", line);
  }
}

void consoleTick() {
  /* Two ways a command gets here, because the Serial Monitor has a line-ending
   * dropdown and it is not the operator's job to know about it.
   *
   * Set to "New Line" it sends p\n and the newline dispatches. Set to "No Line
   * Ending" it sends a bare p and nothing follows, so a parser that waits for a
   * terminator waits forever and the console looks broken. That is a real
   * regression I shipped: character-by-character parsing handled the bare p,
   * line buffering did not.
   *
   * So: dispatch on the newline if one arrives, and otherwise on a short
   * silence. A human cannot type two commands 80 ms apart, and the monitor
   * sends a whole line in one burst, so the silence is unambiguous. */
  static char line[24];
  static uint8_t n = 0;
  static uint32_t lastChar = 0;

