Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/sketch.ino
  while (Serial.available() > 0) {
    int c = Serial.read();
    lastChar = millis();
    if (c == '\\r') continue;
    if (c != '\\n') {
      if (n < sizeof(line) - 1) line[n++] = (char)c;
      continue;
    }
    line[n] = 0;
    uint8_t len = n;
    n = 0;
    if (len > 0) consoleRun(line, len);
  }

  if (n > 0 && (millis() - lastChar) > CONSOLE_IDLE_MS) {
    line[n] = 0;
    uint8_t len = n;
    n = 0;
    consoleRun(line, len);
  }
}

void setup() {
  pinMode(PIN_TRIG, OUTPUT);
  pinMode(PIN_ECHO, INPUT);
  pinMode(LED_PERMIT, OUTPUT);
  pinMode(LED_REFUSE, OUTPUT);
  pinMode(LED_ESCALATE, OUTPUT);
  pinMode(LED_ARMED, OUTPUT);
  pinMode(BTN_PERSON, INPUT_PULLUP);
  pinMode(BTN_NONTARGET, INPUT_PULLUP);
  pinMode(BTN_ESTOP, INPUT);        // GPIO35 has no internal pull-up: add 10k to 3V3
  btnPin[B_PERSON]    = BTN_PERSON;
  btnPin[B_NONTARGET] = BTN_NONTARGET;
  btnPin[B_ESTOP]     = BTN_ESTOP;

  emitAttach();
  emitDuty(0);

  Serial.begin(115200);
  delay(200);
  Serial.println();
  Serial.println("GauKavach bench governor - ESP32");
  Serial.println("========================================");
  Serial.printf("carrier          %lu Hz, %d-bit duty, raised-cosine %d ms ramp\n",
                (unsigned long)CARRIER_HZ, LEDC_RES, RAMP_MS);
  Serial.printf("max activation   %.1f s   (demo %.1f s)\n",
                MAX_ACTIVATION_MS / 1000.0, scaled(MAX_ACTIVATION_MS) / 1000.0);
  Serial.printf("quiet period     %.1f s   (demo %.1f s)\n",
                MIN_SILENCE_MS / 1000.0, scaled(MIN_SILENCE_MS) / 1000.0);
  Serial.printf("daily budget     %.1f s   (demo %.1f s)\n",
                DAILY_BUDGET_MS / 1000.0, scaled(DAILY_BUDGET_MS) / 1000.0);
  Serial.printf("max group        %d\n", MAX_GROUP);
  Serial.println("timers compressed for the demo; shipped values shown first");
  Serial.println("NO calibrated mic attached: this rig makes no dB claim");
  Serial.println();
  selfCheck();
  consoleHelp();
  Serial.println();
}

/* Power-on self check.
 *
 * A governor made of refusals cannot tell you it is miswired: a floating
 * E-stop latches, a dead sensor reads as "nothing there", and both look
 * exactly like the system working correctly and declining to emit. Every
 * silent failure mode in this rig presents as a deliberate refusal, so the
 * inputs get examined once at boot, before the logic can hide behind them. */
void selfCheck() {
  Serial.println("power-on self check");

#if HAVE_ESTOP
  uint8_t lows = 0;
  for (uint8_t i = 0; i < 40; i++) {
    if (digitalRead(BTN_ESTOP) == LOW) lows++;
    delay(5);
  }
  if (lows == 0) {
    Serial.println("  E-stop input    OK, held high");
  } else if (lows == 40) {
    Serial.println("  E-stop input    STUCK LOW - button held closed, or both its "
                   "wires are on the same side of the switch");
  } else {
    Serial.printf("  E-stop input    FLOATING (%u of 40 samples low) - the 10k "
                  "pull-up to 3V3 is not connected\n", lows);
  }
#else
  const uint8_t lows = 0;
  Serial.println("  E-stop input    NOT FITTED - the wired stop is disabled; "
                 "console 'e' still latches");
#endif

#if HAVE_SENSOR
  uint8_t echoes = 0;
  for (uint8_t i = 0; i < 5; i++) {
    if (pingOnceCm() > 0) echoes++;
    delay(60);
  }
  if (echoes > 0) {
    Serial.printf("  distance sensor OK, %u of 5 pings returned\n", echoes);
  } else {
    Serial.println("  distance sensor NO ECHO - check VCC is on VIN/5V not 3V3, "
                   "and that TRIG and ECHO are not swapped");
  }
#else
  const uint8_t echoes = 1;
  Serial.println("  distance sensor NOT FITTED - distance comes from the "
                 "console, type d80");
#endif

#if !HAVE_POT
  Serial.println("  group knob      NOT FITTED - group size comes from the "
                 "console, type g5");
#else
  uint32_t acc = 0;
  for (uint8_t i = 0; i < 16; i++) acc += analogRead(POT_GROUP);
  Serial.printf("  group knob      reads %lu of 4095\n",
                (unsigned long)(acc / 16));
#endif

  if (lows > 0 || echoes == 0) {
    Serial.println("  ^ fix the above before reading anything into a refusal");
  }
#if !HAVE_ESTOP || !HAVE_SENSOR || !HAVE_POT
  Serial.println();
  Serial.println("  DECLARE THIS WHEN YOU DEMONSTRATE:");
#if !HAVE_SENSOR
  Serial.println("    the distance input is typed, not sensed");
#endif
#if !HAVE_POT
  Serial.println("    the group size is typed, not read from a knob");
#endif
#if !HAVE_ESTOP
  Serial.println("    the emergency stop is a console command, not a wired button");
#endif
#if ONE_LAMP_MODE
  Serial.println("    one lamp, not three: solid means emitting, a slow pulse "
                 "means refused, a fast flutter means it gave up");
#elif TWO_LAMP_MODE
  Serial.println("    two lamps, not three: green permits, red refuses, "
                 "red blinking is escalation");
#endif
  Serial.println("    the governor rules below are unchanged and are doing the deciding");
#endif
  Serial.println();
}

/* Raised-cosine rise. Blocking for RAMP_MS, which is acceptable here because
 * nothing else needs servicing during a 25 ms envelope, and it keeps the shape
 * identical to emitter.py rather than approximated by a scheduler. */
void emitStart() {
  for (uint16_t t = 0; t <= RAMP_MS; t++) {
    float x = (float)t / RAMP_MS;                 // 0..1
    float e = 0.5f * (1.0f - cosf(PI * x));       // raised cosine
    emitDuty((uint32_t)(DUTY_PEAK * e));
    delay(1);
  }
  emitDuty(DUTY_PEAK);
}

void emitFade() {
  for (uint16_t t = 0; t <= RAMP_MS; t++) {
    float x = (float)t / RAMP_MS;
    float e = 0.5f * (1.0f + cosf(PI * x));       // mirror of the rise
    emitDuty((uint32_t)(DUTY_PEAK * e));
    delay(1);
  }
  emitDuty(0);
}

void emitStop(const char *why) {
  if (state == EMITTING) {
    emitFade();
    uint32_t dur = millis() - emitStartedAt;
    exposureUsedMs += dur;
    lastEmissionEnd = millis();
    Serial.printf("  emission ended after %lu ms - %s\n", (unsigned long)dur, why);
    if (exposureUsedMs >= scaled(DAILY_BUDGET_MS)) {
      doNotEmit = true;
      Serial.println("  DAILY EXPOSURE BUDGET EXHAUSTED -> do-not-emit latched");
    }
  }
  emitDuty(0);
}

float pingOnceCm() {
  digitalWrite(PIN_TRIG, LOW);  delayMicroseconds(2);
  digitalWrite(PIN_TRIG, HIGH); delayMicroseconds(10);
  digitalWrite(PIN_TRIG, LOW);
  unsigned long us = pulseIn(PIN_ECHO, HIGH, 25000UL);
  if (us == 0) return -1.0f;            // no echo != "animal is adjacent"
  return us / 58.0f;
}

/* Median of three. One bad ping cannot move the answer, and the no-echo case
 * still wins when two of three agree on it - which is the behaviour we want,
 * because 'nothing there' has to stay easy to conclude. */
float readRangeCm() {
  float a = pingOnceCm(); delay(PING_GAP_MS);
  float b = pingOnceCm(); delay(PING_GAP_MS);
  float c = pingOnceCm();
  float hi = max(a, max(b, c));
  float lo = min(a, min(b, c));
  return a + b + c - hi - lo;
}

