Sanskar-Dwivedi/SurakshaMarg-RealOne/hardware/wokwi_esp32/sketch.ino
#if ONE_LAMP_MODE
/* One lamp, three states, told apart by rate. */
void leds(bool p, bool r, bool e) {
  uint32_t ms = millis();
  bool on;
  if (p)      on = true;                        // emitting: solid
  else if (e) on = ((ms / 120) % 2) == 0;       // escalated: fast flutter
  else if (r) on = ((ms / 500) % 2) == 0;       // refusing: slow pulse
  else        on = false;                       // nothing detected
  digitalWrite(LAMP_ONE, on);
}
#elif TWO_LAMP_MODE
/* Two working lamps instead of three.
 *
 * Three states, two lights, so escalation has to be distinguishable from a
 * refusal by something other than colour: it blinks. */
void leds(bool p, bool r, bool e) {
  digitalWrite(LAMP_GO, p);
  bool blink = ((millis() / 250) % 2) == 0;
  digitalWrite(LAMP_STOP, e ? blink : r);
}
#else
void leds(bool p, bool r, bool e) {
  digitalWrite(LED_PERMIT, p);
  digitalWrite(LED_REFUSE, r);
  digitalWrite(LED_ESCALATE, e);
}
#endif

void loop() {
  uint32_t now = millis();

  /* Sample every input on every pass, before any early return. A debounce
   * counter that only advances while a target is present is worse than none:
   * a veto button already held down when the animal walks in would need four
   * more passes to be believed, and the governor would permit emission in the
   * gap. Safety inputs must be settled before they are needed, not after. */
  consoleTick();
  bool person    = pressed(B_PERSON)    || typedPerson;
  bool nonTarget = pressed(B_NONTARGET) || typedNonTarget;
  uint8_t group  = readGroup();

#if HAVE_ESTOP
  if (pressed(B_ESTOP)) estopLatched = true;
#endif
  if (estopLatched) {
    emitStop("E-STOP");
    state = INHIBITED;
    leds(false, true, false);
    digitalWrite(LED_ARMED, LOW);
    if (now - lastPrint > 1000) {
      Serial.println("E-STOP LATCHED - emitter dead until reset");
      lastPrint = now;
    }
    return;
  }

  if (now - lastBeat > 900) { lastBeat = now; armedLed = !armedLed; digitalWrite(LED_ARMED, armedLed); }

#if HAVE_SENSOR
  float cm = readRangeCm();
#else
  float cm = simDistanceCm;
#endif
  bool  seen = (cm > 0 && cm < 200);
  float metres = seen ? (cm / DESK_SCALE) : 999.0f;

  if (state == EMITTING && (now - emitStartedAt) >= scaled(MAX_ACTIVATION_MS)) {
    emitStop("WATCHDOG max activation");
    state = COOLDOWN;
  }

  if (!seen) {
    if (state == EMITTING) emitStop("target lost");
    if (state != INHIBITED) state = IDLE;
    attempts = 0; incidentStart = 0;
    leds(false, false, false);
    return;
  }

  if (incidentStart == 0) {
    incidentStart = now;
    Serial.printf("DETECTION at %.1f m (scaled)\n", metres);
  }

  const char *deny = nullptr;
  if (doNotEmit)                     deny = "animal is on the do-not-emit list";
  else if (person)                   deny = "a person is inside the exposure cone";
  else if (nonTarget)                deny = "a non-target species is inside the cone";
  else if (group > MAX_GROUP)        deny = "group large enough that a startle could cascade";
  else if (metres > RANGE_MAX_M)     deny = "beyond the acoustic envelope";
  else if (metres <= LINE_M)         deny = "already at the carriageway - fleeing would cross it";
  else if (state == COOLDOWN &&
           (now - lastEmissionEnd) < scaled(MIN_SILENCE_MS))
                                     deny = "enforced quiet period";

  bool timedOut = (now - incidentStart) > scaled(ESCALATE_AFTER_MS);
  if (state != EMITTING && (attempts >= MAX_ATTEMPTS || timedOut)) {
    if (state != ESCALATED) {
      emitStop("escalating");
      Serial.println("  ESCALATED -> traffic warning + human dispatch");
      Serial.println("  (acoustic cues are not stock-proof; the system stops)");
      state = ESCALATED;
    }
    leds(false, false, true);
    return;
  }

  if (deny != nullptr) {
    if (state == EMITTING) emitStop(deny);
    state = (state == COOLDOWN) ? COOLDOWN : TRACKING;
    leds(false, true, false);
    if (now - lastPrint > 800) {
      Serial.printf("REFUSED @ %.1f m  group=%d  -> %s\n", metres, group, deny);
      lastPrint = now;
    }
    return;
  }

  if (state != EMITTING) {
    state = EMITTING;
    emitStartedAt = millis();
    attempts++;
    Serial.printf("PERMITTED @ %.1f m  attempt %d/%d  carrier %.1f kHz  ramped %d ms\n",
                  metres, attempts, MAX_ATTEMPTS, CARRIER_HZ / 1000.0, RAMP_MS);
    Serial.printf("  budget used %lu / %lu ms\n",
                  (unsigned long)exposureUsedMs, (unsigned long)scaled(DAILY_BUDGET_MS));
    emitStart();
  }
  leds(true, false, false);
}
